ovedephraim/FW25_Bundle/FW25_20K/firmware_A5_stm32u_eval/Devices/LIS2DW/lis2dw12/lis2dw12_reg.h
typedef enum {
  LIS2DW12_SPI_4_WIRE   = 0,
  LIS2DW12_SPI_3_WIRE   = 1,
} lis2dw12_sim_t;
int32_t lis2dw12_spi_mode_set(stmdev_ctx_t *ctx, lis2dw12_sim_t val);
int32_t lis2dw12_spi_mode_get(stmdev_ctx_t *ctx, lis2dw12_sim_t *val);

typedef enum {
  LIS2DW12_I2C_ENABLE    = 0,
  LIS2DW12_I2C_DISABLE   = 1,
} lis2dw12_i2c_disable_t;
int32_t lis2dw12_i2c_interface_set(stmdev_ctx_t *ctx,
                                   lis2dw12_i2c_disable_t val);
int32_t lis2dw12_i2c_interface_get(stmdev_ctx_t *ctx,
                                   lis2dw12_i2c_disable_t *val);

typedef enum {
  LIS2DW12_PULL_UP_CONNECT     = 0,
  LIS2DW12_PULL_UP_DISCONNECT  = 1,
} lis2dw12_cs_pu_disc_t;
int32_t lis2dw12_cs_mode_set(stmdev_ctx_t *ctx,
                             lis2dw12_cs_pu_disc_t val);
int32_t lis2dw12_cs_mode_get(stmdev_ctx_t *ctx,
                             lis2dw12_cs_pu_disc_t *val);

typedef enum {
  LIS2DW12_ACTIVE_HIGH  = 0,
  LIS2DW12_ACTIVE_LOW   = 1,
} lis2dw12_h_lactive_t;
int32_t lis2dw12_pin_polarity_set(stmdev_ctx_t *ctx,
                                  lis2dw12_h_lactive_t val);
int32_t lis2dw12_pin_polarity_get(stmdev_ctx_t *ctx,
                                  lis2dw12_h_lactive_t *val);

typedef enum {
  LIS2DW12_INT_PULSED   = 0,
  LIS2DW12_INT_LATCHED  = 1,
} lis2dw12_lir_t;
int32_t lis2dw12_int_notification_set(stmdev_ctx_t *ctx,
                                      lis2dw12_lir_t val);
int32_t lis2dw12_int_notification_get(stmdev_ctx_t *ctx,
                                      lis2dw12_lir_t *val);

typedef enum {
  LIS2DW12_PUSH_PULL   = 0,
  LIS2DW12_OPEN_DRAIN  = 1,
} lis2dw12_pp_od_t;
int32_t lis2dw12_pin_mode_set(stmdev_ctx_t *ctx,
                              lis2dw12_pp_od_t val);
int32_t lis2dw12_pin_mode_get(stmdev_ctx_t *ctx,
                              lis2dw12_pp_od_t *val);

int32_t lis2dw12_pin_int1_route_set(stmdev_ctx_t *ctx,
                                    lis2dw12_ctrl4_int1_pad_ctrl_t *val);
int32_t lis2dw12_pin_int1_route_get(stmdev_ctx_t *ctx,
                                    lis2dw12_ctrl4_int1_pad_ctrl_t *val);

int32_t lis2dw12_pin_int2_route_set(stmdev_ctx_t *ctx,
                                    lis2dw12_ctrl5_int2_pad_ctrl_t *val);
int32_t lis2dw12_pin_int2_route_get(stmdev_ctx_t *ctx,
                                    lis2dw12_ctrl5_int2_pad_ctrl_t *val);

int32_t lis2dw12_all_on_int1_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_all_on_int1_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_wkup_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_wkup_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_wkup_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_wkup_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LIS2DW12_HP_FEED           = 0,
  LIS2DW12_USER_OFFSET_FEED  = 1,
} lis2dw12_usr_off_on_wu_t;
int32_t lis2dw12_wkup_feed_data_set(stmdev_ctx_t *ctx,
                                    lis2dw12_usr_off_on_wu_t val);
int32_t lis2dw12_wkup_feed_data_get(stmdev_ctx_t *ctx,
                                    lis2dw12_usr_off_on_wu_t *val);

typedef enum {
  LIS2DW12_NO_DETECTION        = 0,
  LIS2DW12_DETECT_ACT_INACT    = 1,
  LIS2DW12_DETECT_STAT_MOTION  = 3,
} lis2dw12_sleep_on_t;
int32_t lis2dw12_act_mode_set(stmdev_ctx_t *ctx,
                              lis2dw12_sleep_on_t val);
int32_t lis2dw12_act_mode_get(stmdev_ctx_t *ctx,
                              lis2dw12_sleep_on_t *val);

int32_t lis2dw12_act_sleep_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_act_sleep_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_tap_threshold_x_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_tap_threshold_x_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_tap_threshold_y_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_tap_threshold_y_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LIS2DW12_XYZ    = 0,
  LIS2DW12_YXZ    = 1,
  LIS2DW12_XZY    = 2,
  LIS2DW12_ZYX    = 3,
  LIS2DW12_YZX    = 5,
  LIS2DW12_ZXY    = 6,
} lis2dw12_tap_prior_t;
int32_t lis2dw12_tap_axis_priority_set(stmdev_ctx_t *ctx,
                                       lis2dw12_tap_prior_t val);
int32_t lis2dw12_tap_axis_priority_get(stmdev_ctx_t *ctx,
                                       lis2dw12_tap_prior_t *val);

int32_t lis2dw12_tap_threshold_z_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_tap_threshold_z_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_tap_detection_on_z_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lis2dw12_tap_detection_on_z_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lis2dw12_tap_detection_on_y_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lis2dw12_tap_detection_on_y_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lis2dw12_tap_detection_on_x_set(stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lis2dw12_tap_detection_on_x_get(stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lis2dw12_tap_shock_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_tap_shock_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_tap_quiet_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_tap_quiet_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_tap_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_tap_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LIS2DW12_ONLY_SINGLE          = 0,
  LIS2DW12_BOTH_SINGLE_DOUBLE   = 1,
} lis2dw12_single_double_tap_t;
int32_t lis2dw12_tap_mode_set(stmdev_ctx_t *ctx,
                              lis2dw12_single_double_tap_t val);
int32_t lis2dw12_tap_mode_get(stmdev_ctx_t *ctx,
                              lis2dw12_single_double_tap_t *val);

int32_t lis2dw12_tap_src_get(stmdev_ctx_t *ctx,
                             lis2dw12_tap_src_t *val);

int32_t lis2dw12_6d_threshold_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_6d_threshold_get(stmdev_ctx_t *ctx, uint8_t *val);

