ovedephraim/FW25_Bundle/FW25_20K/firmware_A5_stm32u_eval/Devices/LIS2DW/lis2dw12/lis2dw12_reg.h
int32_t lis2dw12_4d_mode_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_4d_mode_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_6d_src_get(stmdev_ctx_t *ctx,
                            lis2dw12_sixd_src_t *val);

typedef enum {
  LIS2DW12_ODR_DIV_2_FEED   = 0,
  LIS2DW12_LPF2_FEED        = 1,
} lis2dw12_lpass_on6d_t;
int32_t lis2dw12_6d_feed_data_set(stmdev_ctx_t *ctx,
                                  lis2dw12_lpass_on6d_t val);
int32_t lis2dw12_6d_feed_data_get(stmdev_ctx_t *ctx,
                                  lis2dw12_lpass_on6d_t *val);

int32_t lis2dw12_ff_dur_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_ff_dur_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LIS2DW12_FF_TSH_5LSb_FS2g  = 0,
  LIS2DW12_FF_TSH_7LSb_FS2g  = 1,
  LIS2DW12_FF_TSH_8LSb_FS2g  = 2,
  LIS2DW12_FF_TSH_10LSb_FS2g = 3,
  LIS2DW12_FF_TSH_11LSb_FS2g = 4,
  LIS2DW12_FF_TSH_13LSb_FS2g = 5,
  LIS2DW12_FF_TSH_15LSb_FS2g = 6,
  LIS2DW12_FF_TSH_16LSb_FS2g = 7,
} lis2dw12_ff_ths_t;
int32_t lis2dw12_ff_threshold_set(stmdev_ctx_t *ctx,
                                  lis2dw12_ff_ths_t val);
int32_t lis2dw12_ff_threshold_get(stmdev_ctx_t *ctx,
                                  lis2dw12_ff_ths_t *val);

int32_t lis2dw12_fifo_watermark_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_fifo_watermark_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LIS2DW12_BYPASS_MODE             = 0,
  LIS2DW12_FIFO_MODE               = 1,
  LIS2DW12_STREAM_TO_FIFO_MODE     = 3,
  LIS2DW12_BYPASS_TO_STREAM_MODE   = 4,
  LIS2DW12_STREAM_MODE             = 6,
} lis2dw12_fmode_t;
int32_t lis2dw12_fifo_mode_set(stmdev_ctx_t *ctx,
                               lis2dw12_fmode_t val);
int32_t lis2dw12_fifo_mode_get(stmdev_ctx_t *ctx,
                               lis2dw12_fmode_t *val);

int32_t lis2dw12_fifo_data_level_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_fifo_ovr_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dw12_fifo_wtm_flag_get(stmdev_ctx_t *ctx, uint8_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /*LIS2DW12_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
